import random as ra

word_list = ["АХМЕД-МЕРТВЫЙ-ТЕРРОРИСТ", "КОРОЧЕ-МЕЧЕНЫЙ", "ГАЧИМУЧИ", "РИКРОЛЛ", "ПАДАЖЖИ", "УПЯЧКА", "ШАР-СВИБОРГА",
             "ВСЕМ-НАСРАТЬ", "САША-ЮВЕЛИР", "ЙОБА-ФЕЙС", "ДИРИЖАБЛЬ-АГА", "БУЙНЫЙ-СЛАВИК",
             "У-МЕНЯ-ТАК-БРАТ-УМЕР", "ОЧЕНЬ-ПЛОХАЯ-МУЗЫКА", "ПУТИН-КРАБ", "ПЕДОБИР", "КОТ-МАНУЛ",
             "ПОВАР-СПРАШИВАЕТ-ПОВАРА", "ФУУУУУУУУУУУУ", "ТРОЛФЕЙС", "НИКИТА-ЛИТВИНКОВ",
             "ТЕХНИЧЕСКИ-НЕОБРАЗОВАННАЯ-УТКА",
             "ЛЕТУН-КОСМИЧЕСКИЙ", "СЛАБОУМИЕ-И-ОТВАГА", "УМЕР-МУЖИК", "СИНИЙ-СВЕРХЧЕЛОВЕК", "ЗАДУМЧИВЫЙ-ПИТЕР-ГРИФФИН",
             "ФИЛЯ-И-КИРЯ", "ЗА-ЧТО-СИДИШЬ", "МИСТЕР-ТРОЛОЛО", "БЛДЖАД", "МЕДВЕДЬ-ШЛЮХА", "ОТЕЦ-И-СЫН",
             "МЕНЯ-ЗОВУТ-ВИТАЛЯ-И-Я-РЕАЛЬНЫЙ-СЕКС", "СПАЙДЕР-МЕМ", "ДА-ЛАДНО", "ФОРЕВЕР-ЭЛОН", "ПАРЕНЬ-С-ХЛОПЬЯМИ",
             "ВСЕ-ОЧЕНЬ-ПЛОХО", "ЭТО-РАЗБОРКА-ПИТЕРСКАЯ", "АЛЬБЕРТ-АКЧУРИН", "РИКАРДО-МИЛОС", "ПЕЩЕРНЫЙ-ЧЕЛОВЕК",
             "ОМАЕВА", "ЛЕТ-МИ-СПИК-ФРОМ-МАЙ-ХАРТ", "ДВА-СТУЛА", "СИЛА-ЗЕМЛИ", "СУЩНОСТЬ-В-ВИДЕ-ГНОМИКА",
             "ОСЛИК-СУСЛИК-ПАУКАН", "ДУХАСТ-ВЯЧЕСЛАВЫЧ", "ГАМАЗ", "ВАТ", "НИКАКОГО-ПРАЗДНИКА", "ГРУСТНЫЙ-КИАНУ-РИВЗ",
             "КАНДИБОБЕР", "БУДЬ-МУЖИКОМ", "ПОКЕР-ФЕЙС", "МИ-ГУСТА", "А-Ю-ФАКИНГ-КИДДИНГ-МИ", "ПИКАП-МАСТЕР",
             "ВИНОВАТ-ВОЛАН-ДЕ-МОРТ", "ДЕД-ДОЕСТ", "ЩЕНОК", "ЭЙ-СЫЩИК", "ПОТЕЮЩИЙ-НЕГР", "ЭТО-НОРМА",
             "ДАВАЙ-ДО-СВИДАНИЯ", "ДЖОН-СНОУ", "МУЖИК-С-ПЕСКОМ", "РОЙ-БИДРИЛ", "АДВОКАТ", "УПОРОТЫЙ-ЛИС", "ЖДУН",
             "НЕЛЬЗЯ-ПРОСТО-ТАК-ВЗЯТЬ", "ШПАГАТ-ВАН-ДАМА", "СТЕЙТХЭМ", "НУ-И-МРАЗЬ-ЖЕ-ТЫ", "ТРИ-ДВА-ДВА",
             "УТКА-ЗРЯ-ЗРЯ", "ГАРЛЕМ-ШЕЙК", "ТАЙНЫ-ЧЕЛОВЕЧЕСТВА", "НАТАЛЬЯ-МОРСКАЯ-ПЕХОТА", "ВСТАВАЙ-НАТАША",
             "НЕ-НАДО-ТАК", "ВЖУХ", "КАКОЙ-ПАЦАН", "УЗБАГОЙСЯ", "РЕБЯТА-Я-В-ЭТОМ-ШАРЮ", "НЕ-РАССТРАИВАЙ-ЯКУБОВИЧА", "КХАЛИСИ",
             "ТЕРЕБОНЬКА", "ЕСТЬ - ПРОБИТИЕ", "КАК - НА - УКРАИНЕ", "О - ВЫ - ИЗ - АНГЛИИ", "ПРЕСС - Ф",
             "ПРИ - ЧЕМ - ТУТ - УКРАИНА", "ШЫНГЫС - ОХУЕВШИЙ", "ВЫ - В - ТАНЦАХ", "ТОТЕМНОЕ - ЖИВОТНОЕ",
             "МАККОНОХИ - ПЛАЧЕТ","ХОХОЧУЩИЙ - ИСПАНЕЦ", "ИНТЕРСТЕЛЛАР", "Я - СДЕЛЯЛЬ", "МУЖИК - ИЗОЛЕНТА", "СОЛЕВАЯ",
             "А - ТЫ - ТОЧНО", "ДЖОННИ - КЭТСВИЛЛ", "ПСС - ПАРЕНЬ", "БАТЯ - ТЕБЕ - НОРМЛАЬНО", "КАМА - ПУЛЯ",
             "Я - ЧЕЛОВЕ - ПРОСТОЙ", "КУДА - ЕДЕМ", "ШЕВЕЛИСЬ-ПЛОТВА", "ПОШЕЛ-Я-НАХЕР", "ТЫ-ЭТО-ВИДЕЛ",
             "МАЙНКРАФТ-МОЯ-ЖИЗНЬ", "ВЫ-НАПУГАЛИ-ДЕДА", "ЧТО-ТАМ-У-ХОХЛОВ", "ХА-ХА-КЛАССИК", "ХАКЕРМЭН", "ПУССУАРЫ",
             "ЮРА-МЫ-ВСЕ-ПРОЕБАЛИ", "ДЖАСТ-ДУ-ИТ",
             "КЕК", "КАРЛ", "ЕЕЕ-РОК", "НИЧОСИ", "МОЕ-УВОЖЕНИЕ", "ТРИГГЕРЕД", "ГОРДЫЙ-ВОЛК", "БЕЛЛИСИМО",
             "ВЕЧЕРИНКА-НЕ-ПОХОЖА", "ФАНТАСТИЧЕСКИЕ-ТВАРИ", "ОТЛИЧНО-РАБОТАЕМ-ДАЛЬШЕ", "ОЧЕНЬ-ПРАВАСЛАВНА",
             "МАККОНОХИ-КУРИТ", "БЕН-АФФЛЕК-КУРИТ", "ЯРИК-БАЧОК-ПОТИК", "ПИТЕР-ПАРКЕР-НАДЕВАЕТ-ОЧКИ",
             "ИНТЕРВЬЮ-С-КОТОМ", "КОЖАНЫЕ-УБЛЮДКИ", "СЫН-МАМИНОЙ-ПОДРУГИ", "КОТЛЕТКИ-С-ПЮРЕШКОЙ", "НЕ-ЛЕЗЬ-ДЕБИЛ",
             "ПИСКУ-ДАШЬ", "ЩА-БУИТ-МЯСО", "МОЯ-ОСТАНОВОЧКА", "МИСТЕР-ДУДЕЦ", "НЕ-ЕШЬ-ПОДУМОЙ", "ДЕНЕГ-НЕТ",
             "ХОРОШЕЧНО", "ГРЭМ", "ДРУТУТИ", "ХОДОР", "КАЧОК-ДОГЕ", "ТЫ-ЧЕВО-НАДЕЛАЛ", "НАЕЛСЯ-И-СПИТ",
             "ПРОСТО-ЗДРАВСТВУЙ", "БЕДЫ-С-БАШКОЙ", "КАМНИ-С-ЛИЦАМИ", "ХТО-Я", "Я-В-ДЕЛЕ", "МАЛЫШ-ЙОДА", "КАК-УЕБУ-СУКА",
             "РАЗБИЙНИК", "ЪУЪ", "СОВРЕМЕННЫЕ-ПРОБЛЕМЫ", "УГАНДА", "ДВА-ЧЕЛОВЕКА-ПАУКА", "ШТОШ",
             "ЭТО-ФИАСКО-БРАТАН", "ДИМОООН", "ХОБА", "ОМАГАД-ОМАГАД", "ТАК-БЛЭТ", "МЫ-С-ПАЦАНАМИ", "АБСОЛЮТНО-НИКТО",
             "ГОБЛИН", "МОЛЬ", "СТОНКС", "ПАПЕЙ-ГАВНА", "ПРОИЗОШЕЛ-ТРОЛЛИНГ",
             "Я-УСТАЛ-БОСС", "ЧТО-ПРОИСХОДИТ", "ПОТРЯСАЮЩИЙ-ХОД"]


def get_word(word):
    return ra.choice(word)


def display_hangman(tries):
    stages = ['''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |    _/ \\_
           -
        ''',
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\_
           -
        ''', # финальное состояние: голова, торс, обе руки, обе ноги
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           -
        ''',
        # голова, торс, обе руки, одна нога
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / 
           -
        ''',
        # голова, торс, обе руки
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |      
           -
        ''',
        # голова, торс и одна рука
        '''
           --------
           |      |
           |      O
           |     \\|
           |      |
           |     
           -
        ''',
        # голова и торс
        '''
           --------
           |      |
           |      O
           |      |
           |      |
           |     
           -
        ''',
        # голова
        '''
           --------
           |      |
           |      O
           |    
           |      
           |     
           -
        ''',
        # начальное состояние
        '''
           --------
           |      |
           |      
           |    
           |      
           |     
           -
        '''

    ]
    return stages[tries]


def play(word):
    word_completion = '*' * len(word)  # строка, содержащая символы * на каждую букву задуманного слова
    guessed = False  # сигнальная метка
    guessed_letters = []  # список уже названных букв
    guessed_words = []  # список уже названных слов
    tries = 8  # количество попыток
    print("Го скатанем в Виселицу!")
    k = [i for i in word_completion]
    print(*k)
    while tries > 0 or guessed == True or y != "STOP":
        x = input("Введи 1 букву КиРиЛлИцЫ или разделитель '-'!").upper()
        if x == "STOP":
            print("Сайонара")
            break
        if x not in "ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮЁ-" or len(x) > 1:
            print("Я же ***** написал, 1 долбанную букву")
            continue
        if x in guessed_letters:
            print("Лол, тебя в детстве роняли? Ты уже писал эту букву!")
            continue
        if x in word and x not in guessed_letters:
            count = 0
            for i in word:
                if i == x:
                    if count == len(word) - 1:
                        word_completion = word_completion[:count] + i
                    elif count == 0:
                        word_completion = i + word_completion[1:]
                    else:
                        word_completion = word_completion[:count] + i + word_completion[count + 1:]
                count += 1
            print(word_completion, "Красава, есть пробитие!")
            if word_completion == word:
                print("Виннер, виннер, чикен динер! Умеешь, могешь!")
                guessed = True
                break
            continue
        if x not in word and x not in guessed_letters:
            tries -= 1
            print(display_hangman(tries))
            print("Опана, в молоко!", word_completion, "осталось попыток:", tries)
        if tries == 0:
            print("Лох, это судьба! Пока на!")
            break
        guessed_letters.append(x)


y = ""
while y != "STOP":
    print("В любой момент, если хочешь закончить это насилие, напиши 'stop'")
    y = input("Хочешь катануть?").upper()
    if y == "STOP" or y == "NO" or y == "НЕТ" or y == "stop":
        print("Чао Какао!")
        break
    else:
        play(get_word(word_list))